Процедура ДобавитьИнструменты(Инструменты) Экспорт

	ДобавитьИнструментПроизвольныйЗапрос(Инструменты);

КонецПроцедуры

Функция ВыполнитьИнструмент(ИмяИнструмента, Аргументы, Настройка = Неопределено) Экспорт

    Если ИмяИнструмента = "execute_query" Тогда
        Возврат ПроизвольныйЗапрос(Аргументы);
    Иначе
        ВызватьИсключение "Неизвестный инструмент: " + ИмяИнструмента;
    КонецЕсли;

КонецФункции

Функция ВернутьДоступныеОбъектыИнструмента(ИмяИнструмента) Экспорт

	МассивОбъектов = Новый Массив;
	Если ИмяИнструмента = "execute_query" Тогда
        ВызватьИсключение "для данного инструмента список объектов недоступен: " + ИмяИнструмента;
    КонецЕсли;
	
	Возврат МассивОбъектов;
	
КонецФункции

#Область ИнструментПроизвольныйЗапрос

Процедура ДобавитьИнструментПроизвольныйЗапрос(Инструменты)

	// Создаем описания параметров для инструмента list_metadata_objects
	МассивПараметров = Новый Массив;
	
	// Параметр query - сам текст
	МассивПараметров.Добавить(aig_Инструменты.ПараметрИнструмента(
		"query",
		"string",
		"Текст запроса",
		,
		Истина
	));
	
	// Параметр parameters - параметры, массив структур
	МассивПараметров.Добавить(aig_Инструменты.ПараметрИнструмента(
		"settings",
		"object",
		"Параметры запроса. Массив структур. Ключ - имя параметра, значение - значение параметра"
	));
	
	// Создаем JSON-схему параметров
	СхемаПараметров = aig_Инструменты.СхемаПараметровИнструмента(МассивПараметров);
	
	// Добавляем инструмент в таблицу
	aig_Инструменты.ДобавитьИнструмент(
		Инструменты,
		"execute_query",
		"Получение данных из базы на основе структуры метаданных",
		СхемаПараметров
	);

КонецПроцедуры

Функция ПроизвольныйЗапрос(Аргументы)

	// Значения по умолчанию
	query     	= Аргументы.query;
	parameters  = ?(Аргументы.Свойство("settings"), Аргументы.settings, Новый Массив);

	Запрос = Новый Запрос;
	Запрос.Текст = query;

	Если ЗначениеЗаполнено(parameters) Тогда
		Для каждого Элемент Из parameters Цикл
			Запрос.УстановитьПараметр(Элемент.Ключ, Элемент.Значение);
		КонецЦикла;
	КонецЕсли;

	РезультатТЗ = Запрос.Выполнить().Выгрузить();
	
	РезультатМассив = Новый Массив;
	Для каждого СтрТЗ Из РезультатТЗ Цикл
		
		Стр = Новый Структура;
		Для каждого Кол Из РезультатТЗ.Колонки Цикл
			Стр.Вставить(Кол.Имя, Строка(СтрТЗ[Кол.Имя]));
		КонецЦикла;
		РезультатМассив.Добавить(Стр);
	КонецЦикла;                     
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, РезультатМассив);
	Результат = ЗаписьJSON.Закрыть();
	
	Возврат Результат;

КонецФункции

#КонецОбласти



