#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		ЗаполнитьИнструментыНаСервере();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьИнструменты(Команда)
	
	Если Объект.Инструменты.Количество() Тогда
		
		ОповещениеОЗаполнении = Новый ОписаниеОповещения("ЗаполнитьИнструментыПродолжение", ЭтотОбъект);
		ПоказатьВопрос(ОповещениеОЗаполнении, 
			"Табличная часть 'Инструменты' будет перезаполнена. Продолжить?",
			РежимДиалогаВопрос.ДаНет);
		Возврат;	
	КонецЕсли;
		
	ЗаполнитьИнструментыНаСервере();
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнитьИнструментыПродолжение(КодОтвета, ДопПараметры) Экспорт

	Если КодОтвета = КодВозвратаДиалога.Нет Тогда
		
		Возврат;
	КонецЕсли;
	
	Объект.Инструменты.Очистить();
	
	ЗаполнитьИнструментыНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийШапкиФормы

#КонецОбласти                   

#Область ОбработчикиСобытийТабличнойЧасти_Инструменты
 
&НаКлиенте
Процедура ИнструментыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = Элемент.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда
		
		Если ЗначениеЗаполнено(ТекДанные.Инструмент) Тогда

			ПараметрыФормы = Новый Структура();
			ПараметрыФормы.Вставить("Ключ", ТекДанные.Инструмент);
		
			ОткрытьФорму("Справочник.AIG_Инструменты.Форма.ФормаЭлемента", 
				ПараметрыФормы, 
				ЭтотОбъект,
				УникальныйИдентификатор);
		КонецЕсли;				
	КонецЕсли;
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьИнструментыНаСервере()
	
	ТаблицаИнструменов = AIG_Инструменты.ПолучитьИнструменты();
	
	Для каждого Инструмент Из ТаблицаИнструменов Цикл
		
		НовыйИнструмент = Объект.Инструменты.Добавить();
		ЗаполнитьЗначенияСвойств(НовыйИнструмент, Инструмент);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти