
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	AIG_АдресСервераGatewayAPI 	= Константы.AIG_АдресСервераGatewayAPI.Получить();
	AIG_ОсновнаяМодель 			= Константы.AIG_ОсновнаяМодель.Получить();
    AIG_СистемнаяРоль 			= Константы.AIG_СистемнаяРоль.Получить();
	AIG_ПередаватьКонтекстЧата	= Константы.AIG_ПередаватьКонтекстЧата.Получить();
	
	Если Не ЗначениеЗаполнено(AIG_СистемнаяРоль) Тогда 
		
		Текст_system_role = Справочники.AIG_Модели.ПолучитьМакет("system_role").ПолучитьТекст();
			
		AIG_СистемнаяРоль = Текст_system_role;
	КонецЕсли;
	
	ЗаполнитьИнструменты()
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Изменение_НастройкиИнструментов" Тогда
		
		ЗаполнитьИнструменты();
	КонецЕсли;
КонецПроцедуры  

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	СохранитьНастройкиНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийШапкиФормы

#КонецОбласти                   

#Область ОбработчикиСобытийТабличнойЧасти_ТаблицаИнструментов

&НаКлиенте
Процедура ТаблицаИнструментовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = Элемент.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда
		
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("Ключ", ТекДанные.Инструмент);
		Если Не ЗначениеЗаполнено(ТекДанные.Инструмент) Тогда
			ПараметрыФормы.Вставить("Наименование", ТекДанные.Имя);
		КонецЕсли;
				
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("ТаблицаИнструментовВыбор_Закрытие", ЭтотОбъект);
		
		ОткрытьФорму("Справочник.AIG_Инструменты.Форма.ФормаЭлемента", 
			ПараметрыФормы, 
			ЭтотОбъект,
			УникальныйИдентификатор,,,
			ОповещениеОЗакрытии,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаИнструментовВыбор_Закрытие(РезультатЗакрытия, ДопПараметры) Экспорт 

	Оповестить("Изменение_НастройкиИнструментов");	

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьИнструменты()
	
	ЗначениеВРеквизитФормы(AIG_Инструменты.ПолучитьИнструменты(), 	"ТаблицаИнструментов");
	ЗначениеВРеквизитФормы(AIG_Ресурсы.ПолучитьРесурсы(), 			"ТаблицаРесурсов");	

КонецПроцедуры 

&НаСервере
Процедура СохранитьНастройкиНаСервере()
	
	Константы.AIG_АдресСервераGatewayAPI.Установить(AIG_АдресСервераGatewayAPI);
	Константы.AIG_ОсновнаяМодель.Установить(AIG_ОсновнаяМодель);
	Константы.AIG_СистемнаяРоль.Установить(AIG_СистемнаяРоль);
	Константы.AIG_ПередаватьКонтекстЧата.Установить(AIG_ПередаватьКонтекстЧата);
	
КонецПроцедуры

#КонецОбласти