#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Параметры.Свойство("Имя", 		Имя);
	Параметры.Свойство("Описание", 	Описание);
	Параметры.Свойство("Purpose", 	Purpose);
	Параметры.Свойство("Analytics", Analytics);	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьИСохранить(Команда)
	
	ПараметрыЗакрытия = Новый Структура("Имя, Описание, Purpose, Analytics");
	ЗаполнитьЗначенияСвойств(ПараметрыЗакрытия, ЭтотОбъект);
	
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область ОбработчикиСобытийШапкиФормы

#КонецОбласти                   


#Область СлужебныеПроцедурыИФункции

#КонецОбласти
