
Процедура ДобавитьИнструменты(Инструменты) Экспорт

	Добавить_СписокМетаданных(Инструменты);
	Добавить_ПолучитьМетаданные(Инструменты);

КонецПроцедуры

Функция ВыполнитьИнструмент(ИмяИнструмента, Аргументы, Настройка = Неопределено) Экспорт

    Если ИмяИнструмента = "list_metadata" Тогда
        Возврат СписокМетаданных(Аргументы, Настройка);
    ИначеЕсли ИмяИнструмента = "get_metadata" Тогда
        Возврат СтруктураМетаданных(Аргументы, Настройка);
    Иначе
        ВызватьИсключение "Неизвестный инструмент: " + ИмяИнструмента;
    КонецЕсли;

КонецФункции

Функция ВернутьДоступныеОбъектыИнструмента(ИмяИнструмента) Экспорт

	СоответствиеМетаданных = Новый Соответствие;
	СоответствиеМетаданных.Вставить("Catalogs", "Справочники");
	СоответствиеМетаданных.Вставить("Documents", "Документы");
	СоответствиеМетаданных.Вставить("InformationRegisters", "РегистрыСведений");
	СоответствиеМетаданных.Вставить("AccumulationRegisters", "РегистрыНакопления");
	СоответствиеМетаданных.Вставить("AccountingRegisters", "РегистрыБухгалтерии");
	СоответствиеМетаданных.Вставить("ChartOfCharacteristicTypes", "ПланыВидовХарактеристик");
	СоответствиеМетаданных.Вставить("ChartOfAccounts", "ПланыСчетов");
	СоответствиеМетаданных.Вставить("ChartOfCalculationTypes", "ПланыВидовРасчета");
	СоответствиеМетаданных.Вставить("BusinessProcess", "БизнесПроцессы");
	СоответствиеМетаданных.Вставить("Tasks", "Задачи");
	СоответствиеМетаданных.Вставить("Reports", "Отчеты");
	СоответствиеМетаданных.Вставить("DataProcessors", "Обработки");
	СоответствиеМетаданных.Вставить("ExchangePlans", "ПланыОбмена");
	СоответствиеМетаданных.Вставить("Constants", "Константы");
	СоответствиеМетаданных.Вставить("Enums", "Перечисления");
	
	МассивОбъектов = Новый Массив;
    Для каждого СоответствиеМД Из СоответствиеМетаданных Цикл
		
		СтруктураОбъекта = AIG_Инструменты.СтруктураДоступногоОбъектаИнструментов();
		СтруктураОбъекта.Имя = СоответствиеМД.Ключ;
		СтруктураОбъекта.Синоним = СоответствиеМД.Значение;
		СтруктураОбъекта.Описание = СоответствиеМД.Значение;
		
		МассивОбъектов.Добавить(СтруктураОбъекта);	
	КонецЦикла;
    
	Возврат МассивОбъектов;
	
КонецФункции

#Область Инструмент_СписокМетаданных

Процедура Добавить_СписокМетаданных(Инструменты)
	
	МассивПараметров = Новый Массив;

	МассивПараметров.Добавить(aig_Инструменты.ПараметрИнструмента(
		"type",
		"string",
		"Тип метаданных"
	));

	СхемаПараметров = aig_Инструменты.СхемаПараметровИнструмента(МассивПараметров);
	
	aig_Инструменты.ДобавитьИнструмент(
		Инструменты,
		"list_metadata",
		"Получение списка объектов метаданных конфигурации",
		СхемаПараметров
	);

КонецПроцедуры

Функция СписокМетаданных(Аргументы, Настройка)
	
	type = Неопределено;
	Аргументы.Свойство("type", type);
	
	ТаблицаНастроек = AIG_Инструменты.ВернутьНастройкиИнструмента(Настройка);

	//СоответствиеТиповМетаданных = Новый Соответствие;
	//СоответствиеТиповМетаданных.Вставить("Catalogs", "Справочники");
	//СоответствиеТиповМетаданных.Вставить("Documents", "Документы");
	//СоответствиеТиповМетаданных.Вставить("InformationRegisters", 	"РегистрыСведений");
	//СоответствиеТиповМетаданных.Вставить("AccumulationRegisters", 	"РегистрыНакопления");
	//СоответствиеТиповМетаданных.Вставить("AccountingRegisters", 	"РегистрыБухгалтерии");
	//СоответствиеТиповМетаданных.Вставить("CalculationRegisters", 	"РегистрыРасчета");
	//,ChartsOfCharacteristicTypes,ChartsOfAccounts,ChartsOfCalculationTypes,BusinessProcesses,Tasks,ExchangePlans,FilterCriteria,Reports,
	//DataProcessors,Enums,CommonModules,SessionParameters,CommonTemplates,CommonPictures,XDTOPackages,
	//WebServices,HTTPServices,WSReferences,Styles,Languages,FunctionalOptions,FunctionalOptionsParameters,
	//DefinedTypes,CommonAttributes,CommonCommands,CommandGroups,Constants,CommonForms,Roles,Subsystems,EventSubscriptions,
	//ScheduledJobs,SettingsStorages,Sequences,DocumentJournals,ExternalDataSources,Interfaces";
	
	МассивМетаданных = Новый Массив;		
	Для каждого НастройкаМД Из ТаблицаНастроек Цикл
		
		КоллекцияМД = Метаданные[НастройкаМД.Описание];
		
		Если Не КоллекцияМД.Количество() Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не НастройкаМД.Доступен Тогда
			Продолжить;
		КонецЕсли;

		Если ЗначениеЗаполнено(type)
			И Не (НастройкаМД.Имя = type
				Или НастройкаМД.Описание = type) Тогда
				
			Продолжить;
		КонецЕсли;
		
		Для Каждого МД Из КоллекцияМД Цикл
			
			СтруктураМетаданных = Новый Структура;
			
			СтруктураМетаданных.Вставить("type", 	НастройкаМД.Имя);
			СтруктураМетаданных.Вставить("typeru", 	НастройкаМД.Синоним);
			СтруктураМетаданных.Вставить("nameid", 	МД.Имя);
			СтруктураМетаданных.Вставить("name", 	МД.Имя);
			СтруктураМетаданных.Вставить("fullname", МД.ПолноеИмя());
			СтруктураМетаданных.Вставить("description", МД.Синоним);
			МассивМетаданных.Добавить(СтруктураМетаданных);
		КонецЦикла;			
	КонецЦикла;
	
	Возврат aig_ОбщегоНазначения.ДанныеВJSON(МассивМетаданных);

КонецФункции

#КонецОбласти

#Область Инструмент_СтруктураМетаданных

Процедура Добавить_ПолучитьМетаданные(Инструменты)

	МассивПараметров = Новый Массив;
	
	МассивПараметров.Добавить(aig_Инструменты.ПараметрИнструмента(
		"type",
		"string",
		"Тип метаданных",
		,
		Истина
	));
	
	МассивПараметров.Добавить(aig_Инструменты.ПараметрИнструмента(
		"name",
		"string",
		"Имя объекта метаданных",
		,
		Истина
	));
	
	// Создаем JSON-схему параметров
	СхемаПараметров = aig_Инструменты.СхемаПараметровИнструмента(МассивПараметров);
	
	// Добавляем инструмент в таблицу
	aig_Инструменты.ДобавитьИнструмент(
		Инструменты,
		"get_metadata",
		"Получение структуры объекта метаданных (реквизиты, табличные части, измерения, ресурсы)",
		СхемаПараметров
	);

КонецПроцедуры

Функция СтруктураМетаданных(Аргументы, Настройка)

	type = Аргументы.type;
	name = Аргументы.name;
	
	// Получаем коллекцию нужного типа
	Попытка
		КоллекцияМД = Метаданные[type];
	Исключение
		ВызватьИсключение "Неизвестный тип метаданных в type: " + type;
	КонецПопытки;
	
	МетаданныеОбъекта = КоллекцияМД.Найти(name);
	Если МетаданныеОбъекта = Неопределено Тогда
		ВызватьИсключение "Объект метаданных не найден: " + type + "." + name;
	КонецЕсли;
	
	ОбработкаОбъект = Создать();
	
	Возврат ОбработкаОбъект.ОписаниеСтруктурыОбъектаМетаданных(МетаданныеОбъекта);
	
КонецФункции

#КонецОбласти


