
Процедура ДобавитьИнструменты(Инструменты) Экспорт

	ДобавитьИнструментСписокОтчетов(Инструменты);
	ДобавитьИнструментРезультатОтчет(Инструменты);

КонецПроцедуры

Функция ВыполнитьИнструмент(ИмяИнструмента, Аргументы, Настройка = Неопределено) Экспорт

    Если ИмяИнструмента = "list_reports" Тогда
        Возврат СписокОтчетов(Аргументы, Настройка);
	ИначеЕсли ИмяИнструмента = "run_report" Тогда
		Возврат ВыполнитьОтчет(Аргументы, Настройка)
    Иначе
        ВызватьИсключение "Неизвестный инструмент: " + ИмяИнструмента;
    КонецЕсли;

КонецФункции

Функция ВернутьДоступныеОбъектыИнструмента(ИмяИнструмента) Экспорт

	МассивОбъектов = Новый Массив;
	Если ИмяИнструмента = "list_reports" Тогда
		
		Для Каждого ОбъектМД Из Метаданные.Отчеты Цикл
			
			СтруктураОбъекта = AIG_Инструменты.СтруктураДоступногоОбъектаИнструментов();
			СтруктураОбъекта.Имя = ОбъектМД.Имя;
			СтруктураОбъекта.Синоним 	= ОбъектМД.Синоним;
			СтруктураОбъекта.Описание 	= ОбъектМД.Синоним;
			
			МассивОбъектов.Добавить(СтруктураОбъекта);
		КонецЦикла;
	Иначе
        ВызватьИсключение "для данного инструмента список объектов недоступен: " + ИмяИнструмента;
    КонецЕсли;
	
	Возврат МассивОбъектов;
	
КонецФункции

#Область ИнструментСписокОтчетов

Процедура ДобавитьИнструментСписокОтчетов(Инструменты)
	
	// Создаем описания параметров для инструмента list_reports
	МассивПараметров = Новый Массив;
	
	МассивПараметров.Добавить(aig_Инструменты.ПараметрИнструмента(
		"reportId",
		"string",
		"ID отчета"
	));
	
	// Создаем JSON-схему параметров
	СхемаПараметров = aig_Инструменты.СхемаПараметровИнструмента(МассивПараметров);
	
	// Добавляем инструмент в таблицу
	aig_Инструменты.ДобавитьИнструмент(
		Инструменты,
		"list_reports",
		"Инструмент предоставляет список отчетов 1С в аналитическом виде.",
		СхемаПараметров
	);

КонецПроцедуры

Функция СписокОтчетов(Аргументы, Настройка)
	
	reportid = Неопределено;
	Если ЗначениеЗаполнено(Аргументы)
		И ТипЗнч(Аргументы) = Тип("Структура") Тогда
		
		Аргументы.Свойство("reportId", reportid);
	КонецЕсли;

	ТаблицаНастроек = AIG_Инструменты.ВернутьНастройкиИнструмента(Настройка);
	
	Массив_reports = Новый Массив;
	Для каждого НастройкиОтчета Из ТаблицаНастроек Цикл
		
		Если Не НастройкиОтчета.Доступен Тогда
			Продолжить;
		КонецЕсли;
				
		Если ЗначениеЗаполнено(reportid) 
			И Не reportid = НастройкиОтчета.Имя Тогда
			Продолжить;
		КонецЕсли;
		
		ОтчетОбъект = Отчеты[НастройкиОтчета.Имя].Создать();
				
		СКД = ОтчетОбъект.СхемаКомпоновкиДанных;
		
		НастройкиСКД = ОтчетОбъект.КомпоновщикНастроек.ПолучитьНастройки();
		
		СтруктураОтчет = Новый Структура;
		СтруктураОтчет.Вставить("report", 		НастройкиОтчета.Описание);
		СтруктураОтчет.Вставить("reportid",  	НастройкиОтчета.Имя);

		ДоступныеПоляВыбора = НастройкиСКД.ДоступныеПоляВыбора.Элементы;
		ПараметрыДанных		= НастройкиСКД.ПараметрыДанных.Элементы;
		
		Массив_dimensions = Новый Массив;
		Массив_measures = Новый Массив;
		Структура_parameters = Новый Структура;

		Для Каждого ДоступноеПоле Из ДоступныеПоляВыбора Цикл
			
			Если ДоступноеПоле.Папка Тогда
				Продолжить;
			КонецЕсли;
			
			Если ДоступноеПоле.Ресурс Тогда
				
				Массив_measures.Добавить(ДоступноеПоле.Заголовок);
			Иначе
				
				Массив_dimensions.Добавить(ДоступноеПоле.Заголовок);
			КонецЕсли;
		КонецЦикла;
				
		Структура_parameters.Вставить("type", "object");  
		Структура_parameters.Вставить("properties", Новый Структура);
		
		Структура_examples = Новый Структура;
		Структура_examples.Вставить("examples", Новый Массив);
		
		МассивОбязательныеПараметры = Новый Массив;
				
		Для Каждого ПараметрДанных Из ПараметрыДанных Цикл
			
			Если Не ПараметрДанных.Использование Тогда
				Продолжить;
			КонецЕсли;
			
			СтруктураПараметра = Новый Структура;
			СтруктураПримерПараметра = Новый Структура;
			Если ТипЗнч(ПараметрДанных.Значение) = Тип("СтандартныйПериод") Тогда 
				
				СтруктураТип = Новый Структура("type", "object");
				
				СтруктураСвойства = Новый Структура;
				
				СтруктураСвойства = Новый Структура;
				СтруктураСвойства.Вставить("start", 
					Новый Структура("type, format, description", 
						"string", "date", "Дата начала в формате YYYY-MM-DD"));
				СтруктураСвойства.Вставить("end", 
					Новый Структура("type, format, description", 
						"string", "date", "Дата окончания в формате YYYY-MM-DD"));
				
				СтруктураТип.Вставить("description", "Период формирования отчета");
				СтруктураТип.Вставить("properties", СтруктураСвойства);
				
				ОбязательныеПараметрыТекущие = Новый Массив;
				ОбязательныеПараметрыТекущие.Добавить("start");
				ОбязательныеПараметрыТекущие.Добавить("end");
				СтруктураТип.Вставить("required", ОбязательныеПараметрыТекущие); 
				
				Структура_parameters.properties.Вставить("Период", СтруктураТип);
				
				МассивОбязательныеПараметры.Добавить("Период");
		
				//Пример
				СтруктураПример_parameters = Новый Структура("Период", Новый Структура("start, end", "2026-01-01", "2026-03-31"));
				
				Структура_run_report = Новый Структура;
				Структура_run_report.Вставить("reportId", "Отчет.Продажи");
				Структура_run_report.Вставить("parameters", СтруктураПример_parameters);
				
				СтруктураПримерПараметра.Вставить("question", "Продажи за 1 квартал 2026");
				СтруктураПримерПараметра.Вставить("run_report", Структура_run_report);
				
				Структура_examples.examples.Добавить(СтруктураПримерПараметра);
			Иначе
				//СтруктураПараметра.Вставить("type", "string");
			КонецЕсли;				
			
		КонецЦикла;                  
		
		Структура_parameters.Вставить("required", МассивОбязательныеПараметры);
		Структура_parameters.Вставить("additionalProperties", false);
		
		Массив_purpose = Новый Массив;
		Массив_analytics = Новый Массив;
		
		Массив_purpose 		= СтрРазделить(НастройкиОтчета.Purpose, Символы.ПС, Ложь);
		Массив_analytics 	= СтрРазделить(НастройкиОтчета.Analytics, Символы.ПС, Ложь);
				
		Массив_data_model = Новый Структура;
		Массив_data_model.Вставить("dimensions", 	Массив_dimensions);
		Массив_data_model.Вставить("measures", 		Массив_measures);
		Массив_data_model.Вставить("parameters", 	Структура_parameters);		
		
		СтруктураОтчет.Вставить("purpose", 		Массив_purpose);
		СтруктураОтчет.Вставить("data_model",   Массив_data_model);
		СтруктураОтчет.Вставить("analytics", 	Массив_analytics);
		
		Массив_reports.Добавить(СтруктураОтчет);
	КонецЦикла;
		
	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку();	
	ЗаписатьJSON(Запись, Массив_reports);	
	
	Возврат Запись.Закрыть();

КонецФункции

#КонецОбласти

#Область ИнструментРезультатОтчета

Процедура ДобавитьИнструментРезультатОтчет(Инструменты)
	
	// Создаем описания параметров для инструмента list_reports
	МассивПараметров = Новый Массив;
	
	МассивПараметров.Добавить(aig_Инструменты.ПараметрИнструмента(
		"reportId",
		"string",
		"ID отчета"
	));
	
	// Параметр parameters - параметры, массив структур
	МассивПараметров.Добавить(aig_Инструменты.ПараметрИнструмента(
		"parameters",
		"object",
		"Параметры запроса. Формат в соответствии со схемой отчета"
	));

	// Создаем JSON-схему параметров
	СхемаПараметров = aig_Инструменты.СхемаПараметровИнструмента(МассивПараметров);
	
	// Добавляем инструмент в таблицу
	aig_Инструменты.ДобавитьИнструмент(
		Инструменты,
		"run_report",
		"Инструмент предоставляет список отчетов 1С в аналитическом виде.",
		СхемаПараметров
	);

КонецПроцедуры

Функция ВыполнитьОтчет(Аргументы, Настройка)

	reportid   		= Аргументы.reportid;
	ПараметрыОтчета = ?(Аргументы.Свойство("parameters"), Аргументы.parameters, Новый Массив);

	МетаданныеОтчет = Метаданные.Отчеты[СтрЗаменить(reportId, "Отчет.", "")];
	ОтчетОбъект = Отчеты[МетаданныеОтчет.Имя].Создать();
	
	СхемаКомпоновкиДанных = ОтчетОбъект.СхемаКомпоновкиДанных;
	Настройки = ОтчетОбъект.КомпоновщикНастроек.ПолучитьНастройки();
	
	ПараметрыДанных	= Настройки.ПараметрыДанных.Элементы;
	Для Каждого ПараметрОтчета Из ПараметрыОтчета Цикл
		
		ПараметрСКД	= ПараметрыДанных.Найти(Новый ПараметрКомпоновкиДанных(ПараметрОтчета.Ключ));
		Если Не ПараметрСКД = Неопределено Тогда
			
			ЗначениеПраметра = Неопределено;
			Если ТипЗнч(ПараметрСКД.Значение) = Тип("СтандартныйПериод") Тогда 
				ЗначениеПраметра = Новый СтандартныйПериод;
				ЗначениеПраметра.ДатаНачала = Дата(СтрЗаменить(ПараметрОтчета.Значение.start, "-", ""));
				ЗначениеПраметра.ДатаОкончания = Дата(СтрЗаменить(ПараметрОтчета.Значение.end, "-", ""));
			Иначе
				
				Продолжить;
			КонецЕсли;
			
			ПараметрСКД.Значение = ЗначениеПраметра;		
		КонецЕсли;
	КонецЦикла;
	
	Для каждого ПараметрДанных Из ПараметрыДанных Цикл
		
		Если Не ПараметрДанных.Использование
			И Не ЗначениеЗаполнено(ПараметрДанных.Значение) Тогда 
			
			ПараметрДанных.Использование = Истина;
		КонецЕсли;
	КонецЦикла;
	
	// 2. Формируем макет компоновки
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, 
		Настройки, 
		,, 
		Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	// 3. Инициализируем процессор данными (расшифровка для таблицы значений не нужна)
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	// 4. Создаем пустую Таблицу Значений для результата
	ТаблицаРезультат = Новый ТаблицаЗначений;
	
	// 5. Выводим результат СКД в созданную таблицу
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

	РезультатМассив = Новый Массив;
	Для каждого СтрТЗ Из ТаблицаРезультат Цикл
		
		Стр = Новый Структура;
		Для каждого Кол Из ТаблицаРезультат.Колонки Цикл
			Стр.Вставить(Кол.Имя, Строка(СтрТЗ[Кол.Имя]));
		КонецЦикла;
		РезультатМассив.Добавить(Стр);
	КонецЦикла;                     
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, РезультатМассив);
	Результат = ЗаписьJSON.Закрыть();
	
	Возврат Результат;

КонецФункции

#КонецОбласти



