Процедура ДобавитьИнструменты(Инструменты) Экспорт

	ДобавитьИнструментСписокНаборов(Инструменты);
	ДобавитьИнструментДанныеНабора(Инструменты);

КонецПроцедуры

Функция ВыполнитьИнструмент(ИмяИнструмента, Аргументы, Настройка = Неопределено) Экспорт

    Если ИмяИнструмента = "list_entities" Тогда
        Возврат СписокНаборов(Аргументы, Настройка);
	ИначеЕсли ИмяИнструмента = "describe_entity" Тогда
		Возврат ДанныеНабора(Аргументы, Настройка);		
    Иначе
        ВызватьИсключение "Неизвестный инструмент: " + ИмяИнструмента;
    КонецЕсли;

КонецФункции

Функция ВернутьДоступныеОбъектыИнструмента(ИмяИнструмента) Экспорт

	МассивОбъектов = Новый Массив;
	Если ИмяИнструмента = "list_entities" Тогда
		
		Для Каждого ОбъектМД Из Метаданные.РегистрыНакопления Цикл
			
			СтруктураОбъекта = AIG_Инструменты.СтруктураДоступногоОбъектаИнструментов();
			СтруктураОбъекта.Имя 		= ОбъектМД.Имя;
			СтруктураОбъекта.Синоним 	= ОбъектМД.Синоним;
			СтруктураОбъекта.Описание 	= ОбъектМД.Синоним;
			
			МассивОбъектов.Добавить(СтруктураОбъекта);
		КонецЦикла;
	Иначе
        ВызватьИсключение "для данного инструмента список объектов недоступен: " + ИмяИнструмента;
    КонецЕсли;
	
	Возврат МассивОбъектов;
	
КонецФункции

#Область ИнструментСписокНаборов

Процедура ДобавитьИнструментСписокНаборов(Инструменты)
	
	// Создаем описания параметров для инструмента list_reports
	МассивПараметров = Новый Массив;
	
	СхемаПараметров = "";
	
	// Добавляем инструмент в таблицу
	aig_Инструменты.ДобавитьИнструмент(
		Инструменты,
		"list_entities",
		"Инструмент предоставляет список наборов данных.",
		СхемаПараметров
	);

КонецПроцедуры

Функция СписокНаборов(Аргументы, Настройка)
	
	ТаблицаНастроек = AIG_Инструменты.ВернутьНастройкиИнструмента(Настройка);
		
	Массив_entities = Новый Массив;
	Для каждого НастройкиРегистра Из ТаблицаНастроек Цикл
		
		Если Не НастройкиРегистра.Доступен Тогда
			Продолжить;
		КонецЕсли;
		
		МетаданныеРегистр = Метаданные.РегистрыНакопления.Найти(НастройкиРегистра.Имя);
		
		description = НастройкиРегистра.Описание;
		usage = НастройкиРегистра.Purpose;
		//Если МетаданныеРегистр = Метаданные.РегистрыНакопления.Продажи Тогда
		//	description = "Информация о продажах товаров и услуг";
		//	usage = "Основной источник данных о продажах";
		//ИначеЕсли МетаданныеРегистр = Метаданные.РегистрыНакопления.Запасы Тогда
		//	description = "Текущие остатки товаров на складах";
		//	usage = "Основной источник складских остатков";
		//КонецЕсли;

		Массив_sources = Новый Массив;
		Массив_sources.Добавить(Новый Структура("register, usage", 
			МетаданныеРегистр.ПолноеИмя(),
			usage));
			
		Массив_dimensions = Новый Массив;
		Для каждого ИзмерениеРегистра Из МетаданныеРегистр.Измерения Цикл
			
			Структура_Измерение = Новый Структура;
			Структура_Измерение.Вставить("name", ИзмерениеРегистра.Имя);
			Структура_Измерение.Вставить("description", ИзмерениеРегистра.Синоним);
			
			Массив_dimensions.Добавить(Структура_Измерение);		
		КонецЦикла;
		
		Массив_metrics = Новый Массив;
		Для каждого РесурсРегистра Из МетаданныеРегистр.Ресурсы Цикл
			
			Структура_Ресурс = Новый Структура;
			Структура_Ресурс.Вставить("name", РесурсРегистра.Имя);
			Структура_Ресурс.Вставить("description", РесурсРегистра.Синоним);
			
			Массив_metrics.Добавить(Структура_Ресурс);
		КонецЦикла;
		
		Структура_entity = Новый Структура;
		Структура_entity.Вставить("entityid", 		НастройкиРегистра.Имя); 
		Структура_entity.Вставить("name", 			НастройкиРегистра.Имя); 
		Структура_entity.Вставить("description", 	description); 
		Структура_entity.Вставить("sources", 		Массив_sources); 
		Структура_entity.Вставить("dimensions", 	Массив_dimensions); 
		Структура_entity.Вставить("metrics", 		Массив_metrics);		
		
		Массив_entities.Добавить(Структура_entity);
	КонецЦикла;

	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку();	
	ЗаписатьJSON(Запись, Массив_entities);	
	
	Возврат Запись.Закрыть();

КонецФункции

#КонецОбласти

#Область ИнструментДанныеНабора

Процедура ДобавитьИнструментДанныеНабора(Инструменты)
	
	// Создаем описания параметров для инструмента list_reports
	МассивПараметров = Новый Массив;
	
	// Параметр entityid
	МассивПараметров.Добавить(aig_Инструменты.ПараметрИнструмента(
		"entityid",
		"string",
		"Наименование регистра",
		,
		Истина
	));

	СхемаПараметров = aig_Инструменты.СхемаПараметровИнструмента(МассивПараметров);
	
	// Добавляем инструмент в таблицу
	aig_Инструменты.ДобавитьИнструмент(
		Инструменты,
		"describe_entity",
		"Инструмент предоставляет данные набора данных.",
		СхемаПараметров
	);

КонецПроцедуры

Функция ДанныеНабора(Аргументы, Настройка)

	entityid = Аргументы.entityid;
	
	МетаданныеРегистр = Метаданные.РегистрыНакопления[СтрЗаменить(entityid, "РегистрНакопления.", "")];
	
	СтруктураРегистра = СтруктураДанныхРегистра();
	
	Массив_dimensions = Новый Массив;
	Для каждого ИзмерениеРегистра Из МетаданныеРегистр.Измерения Цикл
		
		ИмяТипаСтрокой = Метаданные.НайтиПоТипу(ИзмерениеРегистра.Тип.Типы()[0]).ПолноеИмя();
		
		Структура_Измерение = Новый Структура;
		Структура_Измерение.Вставить("name", 		ИзмерениеРегистра.Имя);
		Структура_Измерение.Вставить("description", ИзмерениеРегистра.Синоним);
		Структура_Измерение.Вставить("type", 		ИмяТипаСтрокой);
		
		Массив_dimensions.Добавить(Структура_Измерение);		
	КонецЦикла;
	
	Массив_resources = Новый Массив;
	Для каждого РесурсРегистра Из МетаданныеРегистр.Ресурсы Цикл
		
		ИмяТипаСтрокой = Строка(РесурсРегистра.Тип);
		
		Структура_Измерение = Новый Структура;
		Структура_Измерение.Вставить("name", 		РесурсРегистра.Имя);
		Структура_Измерение.Вставить("description", РесурсРегистра.Синоним);
		Структура_Измерение.Вставить("type", 		ИмяТипаСтрокой);
		
		Массив_resources.Добавить(Структура_Измерение);		
	КонецЦикла;
	
	Структура_entity = Новый Структура;
	Структура_entity.Вставить("register", 		МетаданныеРегистр.Имя);
	Структура_entity.Вставить("type", 			"accumulation");
	Структура_entity.Вставить("description",	СтруктураРегистра.description);
	Структура_entity.Вставить("dimensions",		Массив_dimensions);
	Структура_entity.Вставить("resources",		Массив_resources);
	Структура_entity.Вставить("virtual_tables", СтруктураРегистра.virtual_tables);		
    Структура_entity.Вставить("query_patterns", СтруктураРегистра.query_patterns);		

	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку();	
	ЗаписатьJSON(Запись, Структура_entity);	
	
	Возврат Запись.Закрыть();

КонецФункции

Функция СтруктураДанныхРегистра()
	
	Структура = Новый Структура;
	Структура.Вставить("description", 		"");
	Структура.Вставить("virtual_tables", 	Новый Массив);	
	Структура.Вставить("query_patterns",	Новый Массив);

	Возврат Структура
КонецФункции

#КонецОбласти


