
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Пользователь = Пользователи.ТекущийПользователь();	
	
КонецПроцедуры

&НаКлиенте
Процедура СпроситьAI(Команда)
	
	ОчиститьСообщения();
	
	Если Объект.Ссылка.Пустая()
		Или Модифицированность Тогда
		
		Если Не Записать() Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Успешно = СпроситьAIНаСервере();
	Если Успешно Тогда
		
		Прочитать();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СпроситьAIНаСервере()
	
	Возврат aig_APIСервер.ОтправитьСообщение(Объект.Наименование, Объект.Ссылка);	
	
КонецФункции

&НаКлиенте
Процедура СообщенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = Элемент.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекДанные.Сообщение) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПоказатьЗначение(, ТекДанные.Сообщение);
	КонецЕсли;
	
КонецПроцедуры 
