#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Параметры.Свойство("Наименование", Объект.Наименование);
		
		ЗаполнитьДоступныеОбъектыНаСервере();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьДоступныеОбъекты(Команда)
	
	Если Объект.ДоступныеОбъекты.Количество() Тогда
		
		ОповещениеОЗаполнении = Новый ОписаниеОповещения("ЗаполнитьДоступныеОбъекты_Продолжение", ЭтотОбъект);
		ПоказатьВопрос(ОповещениеОЗаполнении, 
			"Табличная часть 'Доступные объекты' будет перезаполнена. Продолжить?",
			РежимДиалогаВопрос.ДаНет);
		Возврат;	
	КонецЕсли;
		
	ЗаполнитьДоступныеОбъектыНаСервере();
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнитьДоступныеОбъекты_Продолжение(КодОтвета, ДопПараметры) Экспорт

	Если КодОтвета = КодВозвратаДиалога.Нет Тогда
		
		Возврат;
	КонецЕсли;
	
	Объект.ДоступныеОбъекты.Очистить();
	
	ЗаполнитьДоступныеОбъектыНаСервере();
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийШапкиФормы

#КонецОбласти                   

#Область ОбработчикиСобытийТабличнойЧасти_ДоступныеОбъекты

&НаКлиенте
Процедура ДоступныеОбъектыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.ДоступныеОбъектыДоступен Тогда
		
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура("Имя, Описание, Purpose, Analytics");
	ЗаполнитьЗначенияСвойств(ПараметрыФормы, Элемент.ТекущиеДанные);
	
	ОписаниеОЗакрытии = Новый ОписаниеОповещения("ДоступныеОбъектыВыбор_Продолжение", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.AIG_Инструменты.Форма.ФормаНастройкаИнструмента", 
		ПараметрыФормы,
		ЭтотОбъект,
		УникальныйИдентификатор,,,
		ОписаниеОЗакрытии,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеОбъектыВыбор_Продолжение(Результат, ДопПараметры) Экспорт

	Если Не ЗначениеЗаполнено(Результат) Тогда
		
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	ТекущиеДанные = Элементы.ДоступныеОбъекты.ТекущиеДанные;
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, Результат);

КонецПроцедуры	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДоступныеОбъектыНаСервере()
	
	МассивДоступныхОбъектов = AIG_Инструменты.ВернутьДоступныеОбъектыИнструмента(Объект.Наименование);	
	
	Для каждого ДоступныйОбъект Из МассивДоступныхОбъектов Цикл
		
		НовыйДоступныйОбъект = Объект.ДоступныеОбъекты.Добавить();
		ЗаполнитьЗначенияСвойств(НовыйДоступныйОбъект, ДоступныйОбъект);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
