#Область ПрограммныйИнтерфейс

Функция ПолучитьРесурсы() Экспорт
	
	ТаблицаРесурсов = ТаблицаРесурсов();
	ЗаполнитьТаблицуРесурсов(ТаблицаРесурсов);
	
	Возврат ТаблицаРесурсов;
	
КонецФункции

Процедура ДобавитьРесурс(ТаблицаРесурсов, Адрес, Имя, Описание) Экспорт
	
	НоваяСтрока = ТаблицаРесурсов.Добавить();
	НоваяСтрока.Адрес = Адрес;
	НоваяСтрока.Имя = Имя;
	НоваяСтрока.Описание = Описание;
	
КонецПроцедуры

Функция ПрочитатьРесурс(СтрокаТаблицыРесурсов, Адрес) Экспорт
	
	ИмяОбработки = СтрокаТаблицыРесурсов.ИмяОбработкиКонтейнера;
	
	МенеджерОбработки = Обработки[ИмяОбработки];
	
	Возврат МенеджерОбработки.ПрочитатьРесурс(Адрес);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТаблицаРесурсов() Экспорт
	
	ТаблицаРесурсов = Новый ТаблицаЗначений;
	ТаблицаРесурсов.Колонки.Добавить("ИмяОбработкиКонтейнера", Новый ОписаниеТипов("Строка"));
	ТаблицаРесурсов.Колонки.Добавить("Адрес", Новый ОписаниеТипов("Строка"));
	ТаблицаРесурсов.Колонки.Добавить("Имя", Новый ОписаниеТипов("Строка"));
	ТаблицаРесурсов.Колонки.Добавить("Описание", Новый ОписаниеТипов("Строка"));
	
	Возврат ТаблицаРесурсов;
	
КонецФункции

Процедура ЗаполнитьТаблицуРесурсов(ТаблицаРесурсов) Экспорт
	
	СоставПодсистемыКонтейнеры = Метаданные.Подсистемы.AIG_AIGateway.Подсистемы.AIG_Ресурсы.Состав;
	
	Для Каждого МД Из СоставПодсистемыКонтейнеры Цикл
		
		Если НЕ Метаданные.Обработки.Содержит(МД) Тогда
			Продолжить;
		КонецЕсли;
		
		МенеджерОбработки = Обработки[МД.Имя];
		
		// Проверяем наличие метода ДобавитьРесурсы
		Попытка
			// Создаем отдельную таблицу для текущей обработки
			ТекущаяТаблицаРесурсов = ТаблицаРесурсов.СкопироватьКолонки();
			
			// Вызываем метод добавления ресурсов в обработке
			МенеджерОбработки.ДобавитьРесурсы(ТекущаяТаблицаРесурсов);
			
			// Заполняем имя обработки-контейнера и переносим в общую таблицу
			Для Каждого Строка Из ТекущаяТаблицаРесурсов Цикл
				СтрокаОбщейТаблицы = ТаблицаРесурсов.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаОбщейТаблицы, Строка);
				СтрокаОбщейТаблицы.ИмяОбработкиКонтейнера = МД.Имя;
			КонецЦикла;
		Исключение
			// Метод ДобавитьРесурсы не реализован в обработке - пропускаем
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
